ansarirahim/esp32s3-michael-usb-host/reference/main/cdc_acm_vcp_lpc21isp_main.cpp
/*
 * SPDX-FileCopyrightText: 2022-2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: CC0-1.0
 */

#include <stdio.h>
#include <string.h>
#include <cctype>

#include "esp_log.h"
#include "esp_system.h"
#include "esp_heap_caps.h"
#include "nvs_flash.h"
#include "nvs.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"
#include "driver/gpio.h"

#include "usb/cdc_acm_host.h"
#include "usb/vcp_ch34x.hpp"
#include "usb/vcp_cp210x.hpp"
#include "usb/vcp_ftdi.hpp"
#include "usb/vcp.hpp"
#include "usb/usb_host.h"
#include "lpc21isp_esp32.h"
#include "rgb_led.h"
#include "esp32_serial_adapter.h"

// Forward declarations for sync flag management
extern "C" {
void lpc21isp_esp32_set_synchronized(void);
void lpc21isp_esp32_reset_sync_flag(void);
bool lpc21isp_esp32_is_synchronized(void);
void ClearSerialPortBuffers(ISP_ENVIRONMENT *IspEnvironment);
// SendComPort is already declared in lpc21isp.h (included via lpc21isp_esp32.h)
}

// Forward declarations for FatFS functions
extern "C" {
esp_err_t fatfs_init(void);
void fatfs_list_files(void);
esp_err_t fatfs_write_file(const char *filename, const char *content);
esp_err_t fatfs_write_binary_file(const char *filename, const uint8_t *data, size_t data_len);
bool fatfs_file_exists(const char *filename);
esp_err_t fatfs_read_binary_file(const char *filename, uint8_t **buffer, size_t *file_size);
// Forward declaration for MSC device mode
void msc_device_init(void);
}

using namespace esp_usb;

// Change these values to match your needs
//#define LPC21ISP_BAUDRATE     (38400)
#define LPC21ISP_BAUDRATE     (115200)
#define LPC21ISP_STOP_BITS    (0)      // 0: 1 stopbit, 1: 1.5 stopbits, 2: 2 stopbits
#define LPC21ISP_PARITY       (0)      // 0: None, 1: Odd, 2: Even, 3: Mark, 4: Space
#define LPC21ISP_DATA_BITS    (8)

namespace {
static const char *TAG = "VCP_LPC21ISP";
static SemaphoreHandle_t device_disconnected_sem;
static volatile bool bootloader_synchronized = false;  // Flag to indicate bootloader sync
static volatile bool programming_in_progress = false;  // Flag to disable logging during programming
static volatile bool device_disconnected = false;  // Flag to indicate device disconnection

// GPIO0 (BOOT0 button) configuration
#define BOOT0_BUTTON_GPIO GPIO_NUM_0
#define BUTTON_PRESS_TIME_MS 2000  // 2 seconds

// Mode definitions
typedef enum {
    MODE_CDC_HOST = 0,
    MODE_MSC_DEVICE = 1
} device_mode_t;

// NVRAM configuration
#define NVS_NAMESPACE "device_config"
#define NVS_KEY_MODE "mode"

// Queue for deferred processing of received data
#define RX_DATA_QUEUE_SIZE 10
#define MAX_RX_DATA_SIZE 512
typedef struct {
    uint8_t data[MAX_RX_DATA_SIZE];
    size_t data_len;
} rx_data_item_t;
static QueueHandle_t rx_data_queue = NULL;
static TaskHandle_t rx_processing_task_handle = NULL;

// Current device mode (needs to be accessible to button task)
static device_mode_t current_mode = MODE_CDC_HOST;

// Forward declarations
static esp_err_t nvram_write_mode(device_mode_t mode);
static esp_err_t nvram_read_mode(device_mode_t *mode);

/**
 * @brief Task to process received data from queue
 * This runs at lower priority to avoid crashes during programming
 * 
 * @param arg Unused task argument
 */
static void rx_processing_task(void *arg)
{
    rx_data_item_t item;
    
    while (1) {
        // Wait for data from queue (blocking)
        if (xQueueReceive(rx_data_queue, &item, portMAX_DELAY) == pdTRUE) {
            // Skip ALL processing during programming - NxpDownload corrupts memory including heap and logging
            // This includes skipping logging, "Synchronized" detection, etc.
            // Just drop the data to avoid any heap/logging operations
            if (programming_in_progress) {
                // Programming in progress - drop data to avoid crashes
                continue;
            }
            
            // Process the received data only when NOT programming
            if (item.data_len > 0) {
                // Log the data as a string (for text data)
                ESP_LOGI(TAG, "Received %d bytes: %.*s", item.data_len, item.data_len, item.data);
                
                // Check if we received "Synchronized" - bootloader is activated
                // Use stack-allocated buffer instead of malloc to avoid heap corruption issues
                // Limit to MAX_RX_DATA_SIZE to avoid stack overflow
                size_t check_len = (item.data_len < MAX_RX_DATA_SIZE) ? item.data_len : MAX_RX_DATA_SIZE;
                char str[MAX_RX_DATA_SIZE + 1];
                memcpy(str, item.data, check_len);
                str[check_len] = '\0';
                
                // Case-insensitive check for "Synchronized"
                char *found = strstr(str, "Synchronized");
                if (found == NULL) {
                    // Try lowercase - convert in place
                    for (size_t i = 0; i < check_len; i++) {
                        str[i] = tolower((unsigned char)str[i]);
                    }
                    found = strstr(str, "synchronized");
                }
                if (found != NULL) {
                    ESP_LOGI(TAG, "Bootloader activated - received 'Synchronized'");
                    bootloader_synchronized = true;  // Set local flag
                    lpc21isp_esp32_set_synchronized();  // Set flag in wrapper so sync function can see it
                    rgb_led_set_state(LED_STATE_SYNCHRONIZED);
                }
                
                // Also log as hex for debugging binary data
                char hex_str[256];
                size_t hex_len = (item.data_len * 3) + 1; // Each byte takes 3 chars (XX ) + null terminator
                if (hex_len <= sizeof(hex_str)) {
                    char *p = hex_str;
                    for (size_t i = 0; i < item.data_len && i < 85; i++) { // Limit to 85 bytes to fit in log line
                        p += sprintf(p, "%02X ", item.data[i]);
                    }
                    ESP_LOGI(TAG, "Hex: %s", hex_str);
                }
            }
        }
    }
}

/**
 * @brief Task to monitor BOOT0 button (GPIO0)
 * Detects when button is pressed for 2 seconds and toggles the mode
 */
static void boot0_button_task(void *arg)
{
    bool button_pressed = false;
    int press_duration_ms = 0;
    bool mode_toggled = false;
    
    while (1) {
        // Read GPIO0 state (button is active low, so pressed = 0)
        int level = gpio_get_level(BOOT0_BUTTON_GPIO);
        bool is_pressed = (level == 0);
        
