ansarirahim/esp32s3-michael-usb-host/reference/main/cdc_acm_vcp_lpc21isp_main.cpp
        if (is_pressed) {
            if (!button_pressed) {
                // Button just pressed - start timing
                button_pressed = true;
                press_duration_ms = 0;
                mode_toggled = false;
            } else {
                // Button still pressed - increment timer
                press_duration_ms += 100; // Check every 100ms
                
                // Check if pressed for 2 seconds
                if (press_duration_ms >= BUTTON_PRESS_TIME_MS && !mode_toggled) {
                    // Toggle mode
                    device_mode_t old_mode = current_mode;
                    device_mode_t new_mode = (current_mode == MODE_CDC_HOST) ? MODE_MSC_DEVICE : MODE_CDC_HOST;
                    
                    ESP_LOGI(TAG, "BOOT0 button pressed for 2 seconds - toggling mode");
                    ESP_LOGI(TAG, "Current mode: %s (value: %d) -> New mode: %s (value: %d)", 
                            (old_mode == MODE_CDC_HOST) ? "CDC_HOST" : "MSC_DEVICE", old_mode,
                            (new_mode == MODE_CDC_HOST) ? "CDC_HOST" : "MSC_DEVICE", new_mode);
                    
                    esp_err_t err = nvram_write_mode(new_mode);
                    if (err == ESP_OK) {
                        current_mode = new_mode;
                        ESP_LOGI(TAG, "Mode successfully saved to NVRAM: %s (value: %d)", 
                                (current_mode == MODE_CDC_HOST) ? "CDC_HOST" : "MSC_DEVICE", current_mode);
                        ESP_LOGI(TAG, "Resetting MCU to apply new mode...");
                        
                        // Give some time for log messages to be sent
                        vTaskDelay(pdMS_TO_TICKS(200));
                        
                        // Reset the MCU to apply the new mode
                        esp_restart();
                    } else {
                        ESP_LOGE(TAG, "Failed to save mode to NVRAM: %s", esp_err_to_name(err));
                    }
                    
                    mode_toggled = true; // Prevent multiple toggles while button is held
                }
            }
        } else {
            // Button released - reset state
            if (button_pressed) {
                button_pressed = false;
                press_duration_ms = 0;
                mode_toggled = false;
            }
        }
        
        vTaskDelay(pdMS_TO_TICKS(100)); // Check every 100ms
    }
}

/**
 * @brief Data received callback
 * 
 * This callback runs at high priority (from USB interrupt context).
 * We just enqueue the data to be processed later by a lower-priority task.
 * This prevents crashes when NxpDownload is corrupting memory.
 */
static bool handle_rx(const uint8_t *data, size_t data_len, void *arg)
{
    // Always add data to the serial adapter buffer (for ReceiveComPortBlock)
    // This is critical for NxpDownload to receive bootloader responses
    if (data_len > 0) {
        esp32_serial_adapter_add_rx_data(data, data_len);
    }
    
    // Only enqueue to logging queue when NOT programming
    // During programming, NxpDownload reads directly from the serial buffer above
    if (programming_in_progress) {
        return true;  // Skip logging queue during programming
    }
    
    if (data_len > 0 && rx_data_queue != NULL) {
        // Create queue item for logging/debugging
        rx_data_item_t item;
        size_t copy_len = (data_len < MAX_RX_DATA_SIZE) ? data_len : MAX_RX_DATA_SIZE;
        memcpy(item.data, data, copy_len);
        item.data_len = copy_len;
        
        // Send to queue (non-blocking - drop if queue is full to avoid blocking interrupt)
        if (xQueueSend(rx_data_queue, &item, 0) != pdTRUE) {
            // Queue full - data will be dropped
            // This is acceptable as we're just logging/debugging
        }
    }
    return true;
}

/**
 * @brief Device event callback
 *
 * Apart from handling device disconnection it doesn't do anything useful
 *
 * @param[in] event    Device event type and data
 * @param[in] user_ctx Argument we passed to the device open function
 */
static void handle_event(const cdc_acm_host_dev_event_data_t *event, void *user_ctx)
{
    switch (event->type) {
    case CDC_ACM_HOST_ERROR:
        ESP_LOGE(TAG, "CDC-ACM error has occurred, err_no = %d", event->data.error);
        // Errors often indicate device disconnection, set flag to allow graceful exit
        device_disconnected = true;
        break;
    case CDC_ACM_HOST_DEVICE_DISCONNECTED:
        ESP_LOGI(TAG, "Device suddenly disconnected");
        device_disconnected = true;  // Set flag to signal disconnection
        rgb_led_set_state(LED_STATE_IDLE); // Reset to idle when device disconnects
        xSemaphoreGive(device_disconnected_sem);
        break;
    case CDC_ACM_HOST_SERIAL_STATE:
        ESP_LOGI(TAG, "Serial state notif 0x%04X", event->data.serial_state.val);
        break;
    case CDC_ACM_HOST_NETWORK_CONNECTION:
    default: break;
    }
}

/**
 * @brief Write device mode to NVRAM
 * 
 * @param mode Mode to write
 * @return esp_err_t ESP_OK on success
 */
static esp_err_t nvram_write_mode(device_mode_t mode)
{
    nvs_handle_t nvs_handle;
    esp_err_t err;

    err = nvs_open(NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Error opening NVS handle: %s", esp_err_to_name(err));
        return err;
    }

    err = nvs_set_u8(nvs_handle, NVS_KEY_MODE, (uint8_t)mode);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Error writing mode to NVS: %s", esp_err_to_name(err));
        nvs_close(nvs_handle);
        return err;
    }

    err = nvs_commit(nvs_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Error committing NVS: %s", esp_err_to_name(err));
        nvs_close(nvs_handle);
        return err;
    }

    nvs_close(nvs_handle);
    ESP_LOGI(TAG, "Mode saved to NVRAM: %s (value: %d)", 
            (mode == MODE_CDC_HOST) ? "CDC_HOST" : "MSC_DEVICE", mode);
    return ESP_OK;
}

/**
 * @brief Read device mode from NVRAM
 * 
 * @param mode Pointer to store the read mode
 * @return esp_err_t ESP_OK on success
 */
static esp_err_t nvram_read_mode(device_mode_t *mode)
{
    nvs_handle_t nvs_handle;
    esp_err_t err;

    // Try to open with READWRITE first (will create namespace if it doesn't exist)
    err = nvs_open(NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (err != ESP_OK) {
        // If that fails, try READONLY
        err = nvs_open(NVS_NAMESPACE, NVS_READONLY, &nvs_handle);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "Error opening NVS handle: %s", esp_err_to_name(err));
            return err;
        }
    }

    uint8_t mode_value;
    err = nvs_get_u8(nvs_handle, NVS_KEY_MODE, &mode_value);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        // Mode not found in NVS, use default
        *mode = MODE_CDC_HOST;
        ESP_LOGI(TAG, "Mode key '%s' not found in NVS namespace '%s', using default: CDC_HOST", 
                NVS_KEY_MODE, NVS_NAMESPACE);
        nvs_close(nvs_handle);
        return ESP_ERR_NVS_NOT_FOUND;  // Return error so caller knows it's a default
    } else if (err != ESP_OK) {
        ESP_LOGE(TAG, "Error reading mode from NVS: %s", esp_err_to_name(err));
        nvs_close(nvs_handle);
        return err;
    }

    // Validate mode value
    if (mode_value > MODE_MSC_DEVICE) {
        ESP_LOGW(TAG, "Invalid mode value in NVS: %d, using default", mode_value);
        *mode = MODE_CDC_HOST;
        nvs_close(nvs_handle);
        return ESP_ERR_INVALID_ARG;
    } else {
        *mode = (device_mode_t)mode_value;
        ESP_LOGI(TAG, "Mode successfully read from NVS: %s (value: %d)", 
                (*mode == MODE_CDC_HOST) ? "CDC_HOST" : "MSC_DEVICE", mode_value);
    }

    nvs_close(nvs_handle);
    return ESP_OK;
}

/**
 * @brief USB Host library handling task
 *
 * @param arg Unused
 */
static void usb_lib_task(void *arg)
{
    while (1) {
        // Start handling system events
        uint32_t event_flags;
        usb_host_lib_handle_events(portMAX_DELAY, &event_flags);
        if (event_flags & USB_HOST_LIB_EVENT_FLAGS_NO_CLIENTS) {
            ESP_ERROR_CHECK(usb_host_device_free_all());
        }
        if (event_flags & USB_HOST_LIB_EVENT_FLAGS_ALL_FREE) {
            ESP_LOGI(TAG, "USB: All devices freed");
            // Continue handling USB events to allow device reconnection
        }
    }
}

/**
 * @brief Initialize and run CDC Host mode
 */
static void cdc_host_init(void)
{
    device_disconnected_sem = xSemaphoreCreateBinary();
    assert(device_disconnected_sem);

    // Create queue for received data processing
    rx_data_queue = xQueueCreate(RX_DATA_QUEUE_SIZE, sizeof(rx_data_item_t));
    if (rx_data_queue == NULL) {
        ESP_LOGE(TAG, "Failed to create RX data queue");
        return;
    }
    
