ansarirahim/esp32s3-michael-usb-host/reference/main/cdc_acm_vcp_lpc21isp_main.cpp
    // Create task to process received data (lower priority than main task)
    BaseType_t rx_task_created = xTaskCreate(
        rx_processing_task,
        "rx_processor",
        4096,  // Stack size
        NULL,
        5,     // Priority (lower than main task priority of 1)
        &rx_processing_task_handle
    );
    if (rx_task_created != pdTRUE) {
        ESP_LOGE(TAG, "Failed to create RX processing task");
        vQueueDelete(rx_data_queue);
        rx_data_queue = NULL;
        return;
    }

    // Initialize RGB LED
    ESP_LOGI(TAG, "Initializing RGB LED...");
    esp_err_t ret = rgb_led_init();
    if (ret == ESP_OK) {
        // Give RMT time to fully initialize before using it
        // Note: LED state will be set when device connects
        ESP_LOGI(TAG, "RGB LED initialized, will set state when device connects");
    } else {
        ESP_LOGW(TAG, "RGB LED initialization failed, continuing without LED");
    }

    // Initialize FatFS on internal flash
    ESP_LOGI(TAG, "Initializing FatFS...");
    ret = fatfs_init();
    if (ret == ESP_OK) {
        // Copy embedded README.md as readme.txt to storage if it doesn't exist
        if (!fatfs_file_exists("readme.txt")) {
            extern const char README_md_start[] asm("_binary_README_md_start");
            extern const char README_md_end[] asm("_binary_README_md_end");
            const size_t readme_file_size = README_md_end - README_md_start;
            
            ESP_LOGI(TAG, "Copying README.md as readme.txt to storage (%d bytes)...", readme_file_size);
            ret = fatfs_write_binary_file("readme.txt", (const uint8_t*)README_md_start, readme_file_size);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "Successfully copied readme.txt to storage");
            } else {
                ESP_LOGW(TAG, "Failed to copy readme.txt to storage");
            }
        } else {
            ESP_LOGI(TAG, "readme.txt already exists in storage, skipping copy");
        }
        
        // List files in storage
        fatfs_list_files();
    } else {
        ESP_LOGW(TAG, "FatFS initialization failed, continuing without file system");
    }

    // Install USB Host driver. Should only be called once in entire application
    ESP_LOGI(TAG, "Installing USB Host");
    usb_host_config_t host_config = {};
    host_config.skip_phy_setup = false;
    host_config.intr_flags = ESP_INTR_FLAG_LOWMED;
    ESP_ERROR_CHECK(usb_host_install(&host_config));

    // Create a task that will handle USB library events
    BaseType_t task_created = xTaskCreate(usb_lib_task, "usb_lib", 4096, NULL, 10, NULL);
    assert(task_created == pdTRUE);

    ESP_LOGI(TAG, "Installing CDC-ACM driver");
    ESP_ERROR_CHECK(cdc_acm_host_install(NULL));

    // Register VCP drivers to VCP service
    VCP::register_driver<FT23x>();
    VCP::register_driver<CP210x>();
    VCP::register_driver<CH34x>();

    // Do everything else in a loop, so we can demonstrate USB device reconnections
    while (true) {
        const cdc_acm_host_device_config_t dev_config = {
            .connection_timeout_ms = 5000, // 5 seconds, enough time to plug the device in or experiment with timeout
            .out_buffer_size = 512,
            .in_buffer_size = 512,
            .event_cb = handle_event,
            .data_cb = handle_rx,
            .user_arg = NULL,
        };

        // You don't need to know the device's VID and PID. Just plug in any device and the VCP service will load correct (already registered) driver for the device
        device_disconnected = false;  // Reset disconnection flag for new device
        rgb_led_set_state(LED_STATE_CONNECTING);  // Set LED to MAGENTA before attempting to open
        vTaskDelay(pdMS_TO_TICKS(50));  // Give LED time to update before attempting connection
        ESP_LOGI(TAG, "Opening any VCP device...");
        auto vcp = std::unique_ptr<CdcAcmDevice>(VCP::open(&dev_config));

        if (vcp == nullptr) {
            ESP_LOGI(TAG, "Failed to open VCP device");
            // Keep LED as CONNECTING since we'll immediately try again
            // Don't set ERROR here as we're actively trying to connect
            vTaskDelay(pdMS_TO_TICKS(100));  // Small delay before retry
            continue;
        }
        vTaskDelay(10);

        ESP_LOGI(TAG, "Setting up line coding");
        cdc_acm_line_coding_t line_coding = {
            .dwDTERate = LPC21ISP_BAUDRATE,
            .bCharFormat = LPC21ISP_STOP_BITS,
            .bParityType = LPC21ISP_PARITY,
            .bDataBits = LPC21ISP_DATA_BITS,
        };
        ESP_ERROR_CHECK(vcp->line_coding_set(&line_coding));

        /*
        Now the USB-to-UART converter is configured and receiving data.
        You can use standard CDC-ACM API to interact with it. E.g.

        ESP_ERROR_CHECK(vcp->set_control_line_state(false, true));
        ESP_ERROR_CHECK(vcp->tx_blocking((uint8_t *)"Test string", 12));
        */

        // Initialize lpc21isp for bootloader sync
        ESP_LOGI(TAG, "Initializing lpc21isp");
        char baud_str[16];
        snprintf(baud_str, sizeof(baud_str), "%d", LPC21ISP_BAUDRATE);
        
        // Get the CDC handle from the device (we need to access protected member)
        // Since cdc_hdl is protected, we'll need to use a different approach
        // For now, we can use the device's tx_blocking method to verify it works
        // and pass the device pointer itself - but we need the handle
        // Let's create a workaround: store the handle when opening
        cdc_acm_dev_hdl_t cdc_handle = nullptr;
        // We need to access the protected member - create a helper class or use friend
        // For now, let's use a simple cast approach (not ideal but works)
        struct CdcAcmDeviceAccessor : public CdcAcmDevice {
            static cdc_acm_dev_hdl_t get_handle(CdcAcmDevice* dev) {
                return static_cast<CdcAcmDeviceAccessor*>(dev)->cdc_hdl;
            }
        };
        cdc_handle = CdcAcmDeviceAccessor::get_handle(vcp.get());
        
