ansarirahim/esp32s3-michael-usb-host/reference/main/cdc_acm_vcp_lpc21isp_main.cpp
        ISP_ENVIRONMENT *isp_env = lpc21isp_esp32_init(cdc_handle, baud_str);
        
        if (isp_env != nullptr) {
            // Reset sync flag at the start of each programming attempt
            // This ensures we always attempt sync, even if a previous attempt failed
            lpc21isp_esp32_reset_sync_flag();
            
            // Set RTS high FIRST - this must be done before reset
            ESP_LOGI(TAG, "Setting RTS high - preparing for bootloader entry");
            lpc21isp_esp32_reset_to_bootloader(isp_env);
            vTaskDelay(pdMS_TO_TICKS(100));
            
            // Prompt user to manually reset the target device
            ESP_LOGI(TAG, "==========================================");
            ESP_LOGI(TAG, "RTS is now HIGH");
            ESP_LOGI(TAG, "Please manually press RESET button on target device");
            ESP_LOGI(TAG, "Waiting up to 3 minutes for synchronization...");
            ESP_LOGI(TAG, "==========================================");
            rgb_led_set_state(LED_STATE_SYNCHRONIZING);
            
            // Clear any garbage data from the buffer before starting
            if (isp_env != nullptr) {
                ClearSerialPortBuffers(isp_env);
            }
            
            // Wait for the device to enter bootloader mode after reset
            // Then start sending sync characters until synchronized
            // 1800 iterations * 100ms = 180 seconds = 3 minutes
            for (int i = 0; i < 1800; i++) {  // 1800 iterations * 100ms = 3 minutes
                // Check if device was disconnected
                if (device_disconnected) {
                    ESP_LOGW(TAG, "Device disconnected during synchronization - aborting");
                    break;  // Exit loop if device disconnected
                }
                
                // Check if we're already synchronized (set by callback)
                if (lpc21isp_esp32_is_synchronized()) {
                    ESP_LOGI(TAG, "Bootloader synchronized - stopping sync character transmission");
                    break;  // Exit loop early if synchronized
                }
                
                // Verify RTS is still high (in case something overrode it)
                // Only if device is still connected
                if (!device_disconnected) {
                    cdc_handle = CdcAcmDeviceAccessor::get_handle(vcp.get());
                    if (cdc_handle) {
                        esp_err_t rts_err = cdc_acm_host_set_control_line_state(cdc_handle, false, true);  // DTR=unused, RTS=high
                        if (rts_err != ESP_OK) {
                            ESP_LOGW(TAG, "Failed to set RTS (device may be disconnected): %s", esp_err_to_name(rts_err));
                            device_disconnected = true;  // Mark as disconnected on error
                            break;
                        }
                    }
                }
                
                // Wait 100ms (1 iteration) before starting to send sync characters
                // This gives the device time to enter bootloader mode after reset
                // Then send '?' sync character every 500ms (every 5 iterations) to help bootloader sync
                // Only if device is still connected
                if (!device_disconnected && i >= 1 && (i - 1) % 5 == 0 && isp_env != nullptr) {
                    // Clear buffer periodically to avoid accumulating garbage
                    ClearSerialPortBuffers(isp_env);
                    // SendComPort may fail if device is disconnected, but we'll check flag on next iteration
                    SendComPort(isp_env, "?");
                }
                
                vTaskDelay(pdMS_TO_TICKS(100));  // Check every 100ms
            }
            
            // Check if we exited due to disconnection
            if (device_disconnected) {
                ESP_LOGW(TAG, "Synchronization aborted due to device disconnection");
                // Cleanup and wait for next device
                if (isp_env != nullptr) {
                    lpc21isp_esp32_cleanup(isp_env);
                }
                rgb_led_set_state(LED_STATE_IDLE);
                // Wait for device disconnection semaphore (already given, but take it to reset)
                xSemaphoreTake(device_disconnected_sem, 0);  // Non-blocking take to reset semaphore
                continue;  // Go back to waiting for next device
            }
            
            // Final buffer clear before internal sync starts
            if (isp_env != nullptr) {
                ClearSerialPortBuffers(isp_env);
            }
            
            // Check if device disconnected during sync wait
            if (device_disconnected) {
                ESP_LOGW(TAG, "Device disconnected - skipping programming");
                if (isp_env != nullptr) {
                    lpc21isp_esp32_cleanup(isp_env);
                }
                rgb_led_set_state(LED_STATE_IDLE);
                xSemaphoreTake(device_disconnected_sem, 0);  // Non-blocking take to reset semaphore
                continue;  // Go back to waiting for next device
            }
            
            // Check sync status - AppSyncing will skip if already synchronized
            // (Sync flag was reset at start, so if it's set now, it was set during the wait loop)
            if (lpc21isp_esp32_is_synchronized()) {
                ESP_LOGI(TAG, "Already synchronized - internal sync (AppSyncing) will be skipped");
            } else {
                ESP_LOGI(TAG, "Not synchronized yet - internal sync (AppSyncing) will attempt sync");
            }
            
            // Program device from hex file in storage
            // Suspend the RX processing task to prevent any logging during programming
            // This is necessary because NxpDownload corrupts memory including heap and logging system
            if (rx_processing_task_handle != NULL) {
                vTaskSuspend(rx_processing_task_handle);
                // Give a small delay to ensure task is fully suspended
                vTaskDelay(pdMS_TO_TICKS(10));
            }
            __sync_synchronize();  // Memory barrier
            programming_in_progress = true;  // Also set flag for safety
            __sync_synchronize();  // Memory barrier to ensure write is visible
            ESP_LOGI(TAG, "Starting firmware programming from hex file...");
            rgb_led_set_state(LED_STATE_PROGRAMMING);  // Set LED to blue during programming
            int program_result = lpc21isp_esp32_program_from_hex_file(isp_env, "firmware.hex");
            __sync_synchronize();  // Memory barrier
            programming_in_progress = false;  // Clear flag
            __sync_synchronize();  // Memory barrier to ensure write is visible
            // Resume the RX processing task after programming
            if (rx_processing_task_handle != NULL) {
                vTaskResume(rx_processing_task_handle);
            }
            // Log result after a small delay to let any memory corruption settle
            vTaskDelay(pdMS_TO_TICKS(100));
            if (program_result == 0) {
                ESP_LOGI(TAG, "Firmware programming completed successfully!");
                rgb_led_set_state(LED_STATE_SYNCHRONIZED);
            } else {
                ESP_LOGE(TAG, "Firmware programming failed with error: %d", program_result);
                rgb_led_set_state(LED_STATE_ERROR);
                // Reset sync flag on failure - next attempt will need to sync again
                // The device may have exited bootloader mode after the failure
                lpc21isp_esp32_reset_sync_flag();
                ESP_LOGI(TAG, "Sync flag reset - next attempt will re-sync");
            }
            
