ansarirahim/esp32s3-michael-usb-host/reference/main/cdc_acm_vcp_lpc21isp_main.cpp
            // Cleanup lpc21isp
            lpc21isp_esp32_cleanup(isp_env);
        } else {
            ESP_LOGE(TAG, "Failed to initialize lpc21isp");
        }

        // Send some test data
        ESP_LOGI(TAG, "Sending data through CdcAcmDevice");
        const char *test_str = "Hello from ESP32!\n";
        ESP_ERROR_CHECK(vcp->tx_blocking((uint8_t *)test_str, strlen(test_str)));

        // We are done. Wait for device disconnection and start over
        ESP_LOGI(TAG, "Done. You can reconnect the VCP device to run again.");
        xSemaphoreTake(device_disconnected_sem, portMAX_DELAY);
    }
}

/**
 * @brief Main application
 *
 * This function shows how you can use Virtual COM Port drivers
 */
extern "C" void app_main(void)
{
    // Initialize NVS
    ESP_LOGI(TAG, "Initializing NVS...");
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        // NVS partition was truncated and needs to be erased
        ESP_LOGW(TAG, "NVS partition needs to be erased and reinitialized");
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);
    ESP_LOGI(TAG, "NVS initialized");
    
    // Log available memory at startup
    size_t free_heap = esp_get_free_heap_size();
    size_t largest_free_block = heap_caps_get_largest_free_block(MALLOC_CAP_DEFAULT);
    size_t min_free_heap = esp_get_minimum_free_heap_size();
    
    ESP_LOGI(TAG, "==========================================");
    ESP_LOGI(TAG, "Memory Status at Startup:");
    ESP_LOGI(TAG, "  Total free heap: %zu bytes (%.2f KB)", free_heap, free_heap / 1024.0f);
    ESP_LOGI(TAG, "  Largest free block: %zu bytes (%.2f KB)", largest_free_block, largest_free_block / 1024.0f);
    ESP_LOGI(TAG, "  Minimum free heap: %zu bytes (%.2f KB)", min_free_heap, min_free_heap / 1024.0f);
    
    // Check PSRAM availability
    size_t psram_free = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
    size_t psram_largest = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);
    if (psram_free > 0) {
        ESP_LOGI(TAG, "  PSRAM free: %zu bytes (%.2f KB / %.2f MB)", 
                 psram_free, psram_free / 1024.0f, psram_free / (1024.0f * 1024.0f));
        ESP_LOGI(TAG, "  PSRAM largest block: %zu bytes (%.2f KB)", 
                 psram_largest, psram_largest / 1024.0f);
    } else {
        ESP_LOGW(TAG, "  PSRAM: Not available");
    }
    
    // Check internal RAM
    size_t internal_free = heap_caps_get_free_size(MALLOC_CAP_INTERNAL);
    size_t internal_largest = heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL);
    ESP_LOGI(TAG, "  Internal RAM free: %zu bytes (%.2f KB)", 
             internal_free, internal_free / 1024.0f);
    ESP_LOGI(TAG, "  Internal RAM largest block: %zu bytes (%.2f KB)", 
             internal_largest, internal_largest / 1024.0f);
    ESP_LOGI(TAG, "==========================================");
    
    // Debug: Try to open the namespace and check if it exists
    nvs_handle_t debug_handle;
    ret = nvs_open(NVS_NAMESPACE, NVS_READONLY, &debug_handle);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "NVS namespace '%s' exists", NVS_NAMESPACE);
        // Try to read the mode key to see what's there
        uint8_t debug_mode;
        ret = nvs_get_u8(debug_handle, NVS_KEY_MODE, &debug_mode);
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "Found mode key '%s' in NVS with value: %d (%s)", 
                    NVS_KEY_MODE, debug_mode, 
                    (debug_mode == MODE_CDC_HOST) ? "CDC_HOST" : "MSC_DEVICE");
        } else if (ret == ESP_ERR_NVS_NOT_FOUND) {
            ESP_LOGI(TAG, "Mode key '%s' does not exist in NVS namespace '%s'", 
                    NVS_KEY_MODE, NVS_NAMESPACE);
        } else {
            ESP_LOGW(TAG, "Error reading mode key: %s", esp_err_to_name(ret));
        }
        nvs_close(debug_handle);
    } else {
        ESP_LOGI(TAG, "NVS namespace '%s' does not exist yet (error: %s)", 
                NVS_NAMESPACE, esp_err_to_name(ret));
    }

    // Read mode from NVRAM
    esp_err_t mode_read_result = nvram_read_mode(&current_mode);
    if (mode_read_result == ESP_OK) {
        // Mode was successfully read from NVRAM
        ESP_LOGI(TAG, "Mode successfully loaded from NVRAM");
    } else if (mode_read_result == ESP_ERR_NVS_NOT_FOUND) {
        // Mode key doesn't exist in NVS - initialize it with default for this project
        // Since this is the CDC_HOST project, default to CDC_HOST
        current_mode = MODE_CDC_HOST;
        ESP_LOGI(TAG, "Mode key not found in NVS (first run), initializing with default: CDC_HOST");
        
        // Write the default mode to NVS so it's available for both projects
        nvs_handle_t nvs_handle;
        ret = nvs_open(NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
        if (ret == ESP_OK) {
            ret = nvs_set_u8(nvs_handle, NVS_KEY_MODE, (uint8_t)current_mode);
            if (ret == ESP_OK) {
                ret = nvs_commit(nvs_handle);
                if (ret == ESP_OK) {
                    ESP_LOGI(TAG, "Default mode (CDC_HOST) saved to NVRAM");
                } else {
                    ESP_LOGW(TAG, "Failed to commit default mode to NVRAM: %s", esp_err_to_name(ret));
                }
            } else {
                ESP_LOGW(TAG, "Failed to write default mode to NVRAM: %s", esp_err_to_name(ret));
            }
            nvs_close(nvs_handle);
        } else {
            ESP_LOGW(TAG, "Failed to open NVS for writing default mode: %s", esp_err_to_name(ret));
        }
    } else {
        // Other error reading from NVS
        current_mode = MODE_CDC_HOST;
        ESP_LOGE(TAG, "Failed to read mode from NVRAM (error: %s), using default: CDC_HOST", 
                esp_err_to_name(mode_read_result));
    }
    
    // Display current mode prominently
    ESP_LOGI(TAG, "==========================================");
    ESP_LOGI(TAG, "Current Device Mode: %s", 
            (current_mode == MODE_CDC_HOST) ? "CDC_HOST" : "MSC_DEVICE");
    ESP_LOGI(TAG, "==========================================");
    
    // Initialize GPIO0 (BOOT0 button) as input with pull-up
    gpio_config_t io_conf = {};
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_INPUT;
    io_conf.pin_bit_mask = (1ULL << BOOT0_BUTTON_GPIO);
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    io_conf.pull_up_en = GPIO_PULLUP_ENABLE;  // Enable pull-up (button is active low)
    gpio_config(&io_conf);
    ESP_LOGI(TAG, "BOOT0 button (GPIO0) initialized");
    
    // Create task to monitor BOOT0 button (increased stack size to prevent overflow)
    xTaskCreate(boot0_button_task, "boot0_button", 4096, NULL, 5, NULL);
    
    // Dispatch to appropriate mode based on NVRAM setting
    if (current_mode == MODE_CDC_HOST) {
        ESP_LOGI(TAG, "Starting CDC_HOST mode...");
        cdc_host_init();
    } else {
        ESP_LOGI(TAG, "Starting MSC_DEVICE mode...");
        msc_device_init();
    }
} // app_main
} // namespace
